import 'package:get/get.dart';

class MyTranslation extends Translations {
  @override
  Map<String, Map<String, String>> get keys => {
        "ar": {
          "اختر دولتك": "اختر دولتك",
          "اختر دولتك اولا": "اختر دولتك اولا",
          "أدخل رقما": "أدخل رقما",
          "أدخل رقما صحيحا": "أدخل رقما صحيحا",
          "تم انشاء الحساب بنجاح": "تم انشاء الحساب بنجاح",
          "يرجى التسجيل الان": "يرجى التسجيل الان",
          "حدث خطأ": "حدث خطأ",
          "لا يوجد مواد": "لا يوجد مواد",
          "لا يوجد اختيارات": "لا يوجد اختيارات",
          "انت لم تختر المواد التي تدرسها, يرجى اختيار المواد اولا":
              "انت لم تختر المواد التي تدرسها, يرجى اختيار المواد اولا",
          "الخانه الدراسيه السابقه لهذه الخانه فارغه او انك لم تختر شئ من الخانه السابقة":
              "الخانه الدراسيه السابقه لهذه الخانه فارغه او انك لم تختر شئ من الخانه السابقة",
          "انا طالب ولست مدرس؟": "انا طالب ولست مدرس؟",
          "انا مدرس ولست طالبا؟": "انا مدرس ولست طالبا؟",
          "رقم الهاتف": "رقم الهاتف",
          "رؤية المواد المختارة": "رؤية المواد المختارة",
          "اختر نوع مدرستك": "اختر نوع مدرستك",
          "اختر مرحلتك الدراسية": "اختر مرحلتك الدراسية",
          "اختر صفك الدراسي": "اختر صفك الدراسي",
          "اختر المادة": "اختر المادة",
          "اختر المواد التي تدرسها": "اختر المواد التي تدرسها",
          "ادخل اسمك": "ادخل اسمك",
          "يجب ان يكون اسمك من 3 حروف على الاقل":
              "يجب ان يكون اسمك من 3 حروف على الاقل",
          "ادخل اسمك المستعار": "ادخل اسمك المستعار",
          "يجب ان يكون الاسم المستعار من 3 حروف على الاقل":
              "يجب ان يكون الاسم المستعار من 3 حروف على الاقل",
          "ادخل برديك الالكتروني": "ادخل برديك الالكتروني",
          "ادخل بريد الالكتروني صحيح": "ادخل بريد الالكتروني صحيح",
          "معرض الصور": "معرض الصور",
          "الكاميرا": "الكاميرا",
          "التالي": "التالي",
          "تسجيل حساب جديد": "تسجيل حساب جديد",
          "تسجيل الدخول": "تسجيل الدخول",
          "ادخل الكود الذي ارسل اليك": "الكود الذي ارسل اليك",
          "يرجى ادخال كود صحيح": "يرجى ادخال كود صحيح",
          "رمز المرور مرة اخرى": "رمز المرور مرة اخرى",
          "الرمزان غير متطابقان": "الرمزان غير متطابقان",
          "تغير الشفرة": "تغير الشفرة",
          "تعلم من افضل المدرسين": "تعلم من افضل المدرسين",
          "استمع لافضل المدرسين في كل المواد وانت في بيتك":
              "استمع لافضل المدرسين في كل المواد وانت في بيتك",
          "اسال زملائك و مدرسينك": "اسال زملائك و مدرسينك",
          "تواصل مع زملائك و مدرسينك واسالهم عن كل ما يعارضك في طريقك":
              "تواصل مع زملائك و مدرسينك واسالهم عن كل ما يعارضك في طريقك",
          "السابق": "السابق",
          "تم": "تم",
          "خطأ غير معروف!": "خطأ غير معروف!",
          "الرجوع للشاشة الرئيسية": "الرجوع للشاشة الرئيسية",
          "المساعدة": "المساعدة",
          "لا يمكن فتح الواتساب": "لا يمكن فتح الواتساب",
          "تاكد من وجود الواتساب على جهازك": "تاكد من وجود الواتساب على جهازك",
          "لا يوجد اتصال بالانترنت": "لا يوجد اتصال بالانترنت",
          "(router or modem) تحقق من جهاز": "(router or modem) تحقق من جهاز",
          "او أعد الاتصال بشبكة Wifi او بيانات الهاتف او":
              " او أعد الاتصال بشبكة Wifi او بيانات الهاتف او",
          "ادخل رمز المرور": "ادخل رمز المرور",
          "يجب ان يكون رمز المرور 5 حروف على الاقل":
              "يجب ان يكون رمز المرور 5 حروف على الاقل",
          'غير معروف': 'غير معروف',
          "تسجيل كمعلم زائر": "تسجيل كمعلم زائر",
          "مسح الكل": "مسح الكل",
          "اهلا": "اهلا",
          "الغاء": "الغاء",
        },
        "en": {
          "اختر دولتك": "Choose your country",
          "اختر دولتك اولا": "Choose your country first",
          "أدخل رقما": "Enter a number",
          "أدخل رقما صحيحا": "Enter a valid number",
          "تم انشاء الحساب بنجاح": "The account created successfully",
          "يرجى التسجيل الان": "Login now",
          "حدث خطأ": "An error occurred",
          "لا يوجد مواد": "There's no subjects",
          "لا يوجد اختيارات": "There's no chooses",
          "انت لم تختر المواد التي تدرسها, يرجى اختيار المواد اولا":
              "You have not chosen the subjects you are studying, please choose the subjects first",
          "الخانه الدراسيه السابقه لهذه الخانه فارغه او انك لم تختر شئ من الخانه السابقة":
              "The previous academic field for this field is empty, or you did not choose anything from the previous field",
          "انا طالب ولست مدرس؟": "I'm student not teacher?",
          "انا مدرس ولست طالبا؟": "I'm teacher not student?",
          "رقم الهاتف": "Phone number",
          "رؤية المواد المختارة": "View selected subjects",
          "اختر نوع مدرستك": "Choose the type of your school",
          "اختر مرحلتك الدراسية": "Choose your level of study",
          "اختر صفك الدراسي": "Choose your class",
          "اختر المواد التي تدرسها": "Choose the subjects you study",
          "ادخل اسمك": "Enter your name",
          "يجب ان يكون اسمك من 3 حروف على الاقل":
              "Your name must be at least 3 letters",
          "ادخل اسمك المستعار": "Enter your nick name",
          "يجب ان يكون الاسم المستعار من 3 حروف على الاقل":
              "The nickname must be at least 3 letters long",
          "ادخل برديك الالكتروني": "Enter your email",
          "ادخل بريد الالكتروني صحيح": "Enter a valid email",
          "معرض الصور": "Gallery",
          "الكاميرا": "Camera",
          "التالي": "Next",
          "تسجيل حساب جديد": "Signup",
          "تسجيل الدخول": "Login",
          "ادخل الكود الذي ارسل اليك": "Enter the code which send to you",
          "يرجى ادخال كود صحيح": "Please, Enter the right code",
          "رمز المرور مرة اخرى": "The password again",
          "الرمزان غير متطابقان": "The password don't match",
          "تغير الشفرة": "Change the password",
          "تعلم من افضل المدرسين": "Learning from the best teachers",
          "استمع لافضل المدرسين في كل المواد وانت في بيتك":
              "Listen to the best teachers in all subjects at your home",
          "اسال زملائك و مدرسينك": "Ask your teachers and your friends",
          "تواصل مع زملائك و مدرسينك واسالهم عن كل ما يعارضك في طريقك":
              "Communicate with your colleagues and teachers and ask them about everything that stands in your way",
          "السابق": "Back",
          "تم": "Done",
          "خطأ غير معروف!": "Unknown Error!",
          "الرجوع للشاشة الرئيسية": "Back to main Screen",
          "المساعدة": "help",
          "لا يمكن فتح الواتساب": "Can't open the Whatsapp on your device",
          "تاكد من وجود الواتساب على جهازك":
              "Make sure you have the whatsapp on your device",
          "لا يوجد اتصال بالانترنت": "No connection with internet",
          "(router or modem) تحقق من جهاز":
              "Check the device (router or modem)",
          "او أعد الاتصال بشبكة Wifi او بيانات الهاتف او":
              "or mobile data or wifi or reconnecting to the internet",
          "ادخل رمز المرور": "Enter the password",
          "يجب ان يكون رمز المرور 5 حروف على الاقل":
              "The password must be at least 5 characters long",
          'غير معروف': 'Unknown',
          "تسجيل كمعلم زائر": "Login as a visitor teacher",
          "مسح الكل": "Delete all",
          "اهلا": "hello",
          "الغاء": "Cancel",
        }
      };
}
